#include <iostream>
#include "SingleList.h"
#include "BinaryTree.h"
using namespace std;

int main()
{
    /*Задача 1. Порахувати суму двох чисел, записаних користувачем. 
    
    Задача 2. Зробити метод, що об'єднує  . Списки
    можна згенерувати випадковим чином.

    Задача 3. Зробити метод, що об'єднує два двозвязних списка. Списки
    можна згенерувати випадковим чином. 

    Задача 4. Зробити метод, що об'єднує два бінарних дерева. Дерева можна
    заповнити дерева випадковим чином.

    Задача 5. Зробити класс, що буде представлений як рядок, в якому 
    використовується однозв'язний список для зберігання інформації.

    Задача 6. В класі зробленому в задачі 5 зробити методи "lower", "upper"
    "isNumber", "isAlpha", "getLength" та "capitalize"(всі крім першої букви
    маленькі, перша велика). Використати по максимуму властивості списку. 
    Відкрити в public показчик списка "begin" та використовувати його в методах
    вашого рядка.

    Задача 7. В класі зробленому в задачі 6 зробити перевантаження оператора,
    що повертає рядок в форматі "char*"(виділивши під нього пам'ять і повернувши
    результат)
    */
}