#include <iostream>
/*
Задача 1. Створити клас рядка. Створити поле для масива символів та розміру масива. Написати конструктор за замовчуванням та 
конструктор з ініціалізацією

Задача 2. Перевантажити оператор +, що буде додавати рядки і створювати новий більний рядок складений з двох попередніх

Задача 3. Перевантажити оператори (>, <, ==, !=), що буде відповідати на питання чи один рядок по розміру більший за інший

Задача 4. Перевантажити оператор інкремента ++, що розширить рядок і зробить його на 1 пробільний символ більше

Задача 5. Перевантажити оператор декремента --, що забере один символ з рядка і зробить його менше відкинувши втрачений символ
зберігаючи '\0' в кінці

Задача 6. Перевантажити оператор унарного мінуса, що розверне рядок навпаки і поставить всі символи в зворотньому порядку
*/

int main()
{
    std::cout << "Hello World!\n";
}
