#include <iostream>
using namespace std;

class My_array {
    int* arr;
    int size;
    My_array() : arr(nullptr), size(0) {}
    My_array(int _size) : size(_size), arr(new int[_size]) { }
    My_array(int* _arr, int _size) : size(_size), arr(new int[_size]) {
        for (int  i = 0; i < size; i++){ arr[i] = _arr[i]; }
    }
    void print() {
        for (int i = 0; i < size; i++) { cout << arr[i] << ','; }
    }

    void add(int element) 
    { 
        int* arr2 = new int[size + 1];
        for (int i = 0; i < size; i++) { arr2[i] = arr[i]; }
        arr2[size] = element;
        delete[] arr;
        arr = arr2;
        size++;
    }
};

// Задача 1. Створити клас "динамічний масив". В класі мають зберігатись
// цілі числа. Класс має пам'ятати свій розмір. Метод що виводить весь массив
// в рядок через кому на екран.
// 
// Задача 1.1. Конструктор за замовчуванням створює пустий массив.
// Конструктор з 1 цілим числом. Створює пустий массив вказаного розміру
// Конструктор з массивом і розміром записує весь массив в об'єкт
// 
// Задача 2. Реалізувати методи по додаванню видаленю елементів з массива
// (з перевиділенням пам'яті). 
// 
// Задача 3. Метод, що шукає перший заданий елемент та повертає його індекс. 
// Повертає сумму елементів.
// 
// Задача 4. Повертає мінімальний та максимальний елементи. 
// 
// Задача 5. Має метод що відсортує масив будь-яким методом.

int main()
{
    std::cout << "Hello World!\n";
}
