#include <iostream>
#include <Windows.h>
// створення класу
// визначення полів класу/властивості класу
// конструктор класу
// метод класу
// деструктор класу

class Point { // користувацький шаблон данних з реалізованою логікою роботи
public:
    int x; // поле/змінна/властивість класу
    int y;
    Point() { // метод(функція) класу, що автоматично виклиється при спробі
              // створити один екземпляр класу
        x = 0;
        y = 0;
        printf("Створено точку зі значеннями за замовчуванням.\n");
    }
    Point(int cordX, int cordY) { // перевантаження конструктора з іншим набором
                                  // аргументів, для створення варіацій при 
                                  // використанні класу. Можна або з значеннями, 
                                  // користувача, або з значеннями за 
                                  // замовчуванням створити точку
        x = cordX; y = cordY;
        printf("Створено точку за користувацькими данними.\n");
    }
    ~Point() {
        printf("Видалено з пам'яті точку.\n");
    }
};

int main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    Point p1 = Point(); // виклик конструткора для створення об'єкта з значеннями
                        // за замовчуванням
    
    Point p2 = Point(1, 2); // виклик конструктора для створення об'єкта з значеннями
                            // які передано за допомогою параметрів

}
